'''Задание 1: Операции с кортежами

Условие: Создайте кортеж, содержащий три целых числа. 
Выведите на экран каждое число, а затем выведите их сумму.
'''

tuple=(18,9,55)

print(f'Кортеж: {tuple}')
print(f'Первое число: {tuple[0]}')
print(f'Второе число: {tuple[1]}')
print(f'Третье число: {tuple[2]}')
print(f'Сумма: {sum(tuple)}')

